MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP16GS202/mcu.h
/* Generic structure of entire SFR area for each SPI module */
typedef struct tagSPI {
        uint16_t spixstat;
        uint16_t spixcon1;
        uint16_t spixcon2;
        uint16_t unused;
        uint16_t spixbuf;
} SPI, *PSPI;

#define SPIxSTATBITS SPI1STATBITS
#define SPIxCONBITS SPI1CONBITS

#define SPI1 SPI1
extern volatile SPI SPI1 __attribute__((__sfr__));

#define SPI1STAT SPI1STAT
extern volatile uint16_t SPI1STAT __attribute__((__sfr__));
__extension__ typedef struct tagSPI1STATBITS {
  union {
    struct {
      uint16_t SPIRBF:1;
      uint16_t SPITBF:1;
      uint16_t SISEL:3;
      uint16_t SRXMPT:1;
      uint16_t SPIROV:1;
      uint16_t SRMPT:1;
      uint16_t SPIBEC:3;
      uint16_t :2;
      uint16_t SPISIDL:1;
      uint16_t :1;
      uint16_t SPIEN:1;
    };
    struct {
      uint16_t :2;
      uint16_t SISEL0:1;
      uint16_t SISEL1:1;
      uint16_t SISEL2:1;
      uint16_t :3;
      uint16_t SPIBEC0:1;
      uint16_t SPIBEC1:1;
      uint16_t SPIBEC2:1;
    };
  };
} SPI1STATBITS;
extern volatile SPI1STATBITS SPI1STATbits __attribute__((__sfr__));

#define SPI1CON1 SPI1CON1
extern volatile uint16_t SPI1CON1 __attribute__((__sfr__));
__extension__ typedef struct tagSPI1CON1BITS {
  union {
    struct {
      uint16_t PPRE:2;
      uint16_t SPRE:3;
      uint16_t MSTEN:1;
      uint16_t CKP:1;
      uint16_t SSEN:1;
      uint16_t CKE:1;
      uint16_t SMP:1;
      uint16_t MODE16:1;
      uint16_t DISSDO:1;
      uint16_t DISSCK:1;
    };
    struct {
      uint16_t PPRE0:1;
      uint16_t PPRE1:1;
      uint16_t SPRE0:1;
      uint16_t SPRE1:1;
      uint16_t SPRE2:1;
    };
  };
} SPI1CON1BITS;
extern volatile SPI1CON1BITS SPI1CON1bits __attribute__((__sfr__));

#define SPI1CON2 SPI1CON2
extern volatile uint16_t SPI1CON2 __attribute__((__sfr__));
__extension__ typedef struct tagSPI1CON2BITS {
  union {
    struct {
      uint16_t SPIBEN:1;
      uint16_t SPIFE:1;
      uint16_t :11;
      uint16_t SPIFPOL:1;
      uint16_t SPIFSD:1;
      uint16_t FRMEN:1;
    };
    struct {
      uint16_t :1;
      uint16_t FRMDLY:1;
      uint16_t :11;
      uint16_t FRMPOL:1;
    };
  };
} SPI1CON2BITS;
extern volatile SPI1CON2BITS SPI1CON2bits __attribute__((__sfr__));

#define SPI1BUF SPI1BUF
extern volatile uint16_t SPI1BUF __attribute__((__sfr__));
#define ADCON1L ADCON1L
extern volatile uint16_t ADCON1L __attribute__((__sfr__));
typedef struct tagADCON1LBITS {
  uint16_t :7;
  uint16_t NRE:1;
  uint16_t :5;
  uint16_t ADSIDL:1;
  uint16_t :1;
  uint16_t ADON:1;
} ADCON1LBITS;
extern volatile ADCON1LBITS ADCON1Lbits __attribute__((__sfr__));

#define ADCON1H ADCON1H
extern volatile uint16_t ADCON1H __attribute__((__sfr__));
__extension__ typedef struct tagADCON1HBITS {
  union {
    struct {
      uint16_t :5;
      uint16_t SHRRES:2;
      uint16_t FORM:1;
    };
    struct {
      uint16_t :5;
      uint16_t SHRRES0:1;
      uint16_t SHRRES1:1;
    };
  };
} ADCON1HBITS;
extern volatile ADCON1HBITS ADCON1Hbits __attribute__((__sfr__));

#define ADCON2L ADCON2L
extern volatile uint16_t ADCON2L __attribute__((__sfr__));
__extension__ typedef struct tagADCON2LBITS {
  union {
    struct {
      uint16_t SHRADCS:7;
      uint16_t :1;
      uint16_t SHREISEL:3;
      uint16_t :1;
      uint16_t EIEN:1;
      uint16_t :1;
      uint16_t REFERCIE:1;
      uint16_t REFCIE:1;
    };
    struct {
      uint16_t SHRADCS0:1;
      uint16_t SHRADCS1:1;
      uint16_t SHRADCS2:1;
      uint16_t SHRADCS3:1;
      uint16_t SHRADCS4:1;
      uint16_t SHRADCS5:1;
      uint16_t SHRADCS6:1;
      uint16_t :1;
      uint16_t SHREISEL0:1;
      uint16_t SHREISEL1:1;
      uint16_t SHREISEL2:1;
    };
  };
} ADCON2LBITS;
extern volatile ADCON2LBITS ADCON2Lbits __attribute__((__sfr__));

#define ADCON2H ADCON2H
extern volatile uint16_t ADCON2H __attribute__((__sfr__));
__extension__ typedef struct tagADCON2HBITS {
  union {
    struct {
      uint16_t SHRSAMC:10;
      uint16_t :4;
      uint16_t REFERR:1;
      uint16_t REFRDY:1;
    };
    struct {
      uint16_t SHRSAMC0:1;
      uint16_t SHRSAMC1:1;
      uint16_t SHRSAMC2:1;
      uint16_t SHRSAMC3:1;
      uint16_t SHRSAMC4:1;
      uint16_t SHRSAMC5:1;
      uint16_t SHRSAMC6:1;
      uint16_t SHRSAMC7:1;
      uint16_t SHRSAMC8:1;
      uint16_t SHRSAMC9:1;
    };
  };
} ADCON2HBITS;
extern volatile ADCON2HBITS ADCON2Hbits __attribute__((__sfr__));

#define ADCON3L ADCON3L
extern volatile uint16_t ADCON3L __attribute__((__sfr__));
__extension__ typedef struct tagADCON3LBITS {
  union {
    struct {
      uint16_t CNVCHSEL:6;
      uint16_t SWCTRG:1;
      uint16_t SWLCTRG:1;
      uint16_t CNVRTCH:1;
      uint16_t SHRSAMP:1;
      uint16_t SUSPRDY:1;
      uint16_t SUSPCIE:1;
      uint16_t SUSPEND:1;
      uint16_t REFSEL:3;
    };
    struct {
      uint16_t CNVCHSEL0:1;
      uint16_t CNVCHSEL1:1;
      uint16_t CNVCHSEL2:1;
      uint16_t CNVCHSEL3:1;
      uint16_t CNVCHSEL4:1;
      uint16_t CNVCHSEL5:1;
      uint16_t :7;
      uint16_t REFSEL0:1;
      uint16_t REFSEL1:1;
      uint16_t REFSEL2:1;
    };
  };
} ADCON3LBITS;
extern volatile ADCON3LBITS ADCON3Lbits __attribute__((__sfr__));

#define ADCON3H ADCON3H
extern volatile uint16_t ADCON3H __attribute__((__sfr__));
__extension__ typedef struct tagADCON3HBITS {
  union {
    struct {
      uint16_t C0EN:1;
      uint16_t C1EN:1;
      uint16_t :5;
      uint16_t SHREN:1;
      uint16_t CLKDIV:6;
      uint16_t CLKSEL:2;
    };
    struct {
      uint16_t :8;
      uint16_t CLKDIV0:1;
      uint16_t CLKDIV1:1;
      uint16_t CLKDIV2:1;
      uint16_t CLKDIV3:1;
      uint16_t CLKDIV4:1;
      uint16_t CLKDIV5:1;
      uint16_t CLKSEL0:1;
      uint16_t CLKSEL1:1;
    };
  };
} ADCON3HBITS;
extern volatile ADCON3HBITS ADCON3Hbits __attribute__((__sfr__));

#define ADCON4L ADCON4L
extern volatile uint16_t ADCON4L __attribute__((__sfr__));
typedef struct tagADCON4LBITS {
  uint16_t SAMC0EN:1;
  uint16_t SAMC1EN:1;
  uint16_t :6;
  uint16_t SYNCTRG0:1;
  uint16_t SYNCTRG1:1;
} ADCON4LBITS;
