MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP16GS202/mcu.h
#define ADTRIG1L ADTRIG1L
extern volatile uint16_t ADTRIG1L __attribute__((__sfr__));
__extension__ typedef struct tagADTRIG1LBITS {
  union {
    struct {
      uint16_t TRGSRC4:5;
      uint16_t :3;
      uint16_t TRGSRC5:5;
    };
    struct {
      uint16_t TRIGSRC40:1;
      uint16_t TRIGSRC41:1;
      uint16_t TRIGSRC42:1;
      uint16_t TRIGSRC43:1;
      uint16_t TRIGSRC44:1;
      uint16_t :3;
      uint16_t TRGSRC50:1;
      uint16_t TRGSRC51:1;
      uint16_t TRGSRC52:1;
      uint16_t TRGSRC53:1;
      uint16_t TRGSRC54:1;
    };
    struct {
      uint16_t TRGSRC40:1;
      uint16_t TRGSRC41:1;
      uint16_t TRGSRC42:1;
      uint16_t TRGSRC43:1;
      uint16_t TRGSRC44:1;
    };
  };
} ADTRIG1LBITS;
extern volatile ADTRIG1LBITS ADTRIG1Lbits __attribute__((__sfr__));

#define ADTRIG1H ADTRIG1H
extern volatile uint16_t ADTRIG1H __attribute__((__sfr__));
__extension__ typedef struct tagADTRIG1HBITS {
  union {
    struct {
      uint16_t TRGSRC6:5;
      uint16_t :3;
      uint16_t TRGSRC7:5;
    };
    struct {
      uint16_t TRIGSRC60:1;
      uint16_t TRIGSRC61:1;
      uint16_t TRIGSRC62:1;
      uint16_t TRIGSRC63:1;
      uint16_t TRIGSRC64:1;
      uint16_t :3;
      uint16_t TRGSRC70:1;
      uint16_t TRGSRC71:1;
      uint16_t TRGSRC72:1;
      uint16_t TRGSRC73:1;
      uint16_t TRGSRC74:1;
    };
    struct {
      uint16_t TRGSRC60:1;
      uint16_t TRGSRC61:1;
      uint16_t TRGSRC62:1;
      uint16_t TRGSRC63:1;
      uint16_t TRGSRC64:1;
    };
  };
} ADTRIG1HBITS;
extern volatile ADTRIG1HBITS ADTRIG1Hbits __attribute__((__sfr__));

#define ADTRIG2L ADTRIG2L
extern volatile uint16_t ADTRIG2L __attribute__((__sfr__));
__extension__ typedef struct tagADTRIG2LBITS {
  union {
    struct {
      uint16_t TRGSRC8:5;
      uint16_t :3;
      uint16_t TRGSRC9:5;
    };
    struct {
      uint16_t TRIGSRC80:1;
      uint16_t TRIGSRC81:1;
      uint16_t TRIGSRC82:1;
      uint16_t TRIGSRC83:1;
      uint16_t TRIGSRC84:1;
      uint16_t :3;
      uint16_t TRGSRC90:1;
      uint16_t TRGSRC91:1;
      uint16_t TRGSRC92:1;
      uint16_t TRGSRC93:1;
      uint16_t TRGSRC94:1;
    };
    struct {
      uint16_t TRGSRC80:1;
      uint16_t TRGSRC81:1;
      uint16_t TRGSRC82:1;
      uint16_t TRGSRC83:1;
      uint16_t TRGSRC84:1;
    };
  };
} ADTRIG2LBITS;
extern volatile ADTRIG2LBITS ADTRIG2Lbits __attribute__((__sfr__));

#define ADTRIG2H ADTRIG2H
extern volatile uint16_t ADTRIG2H __attribute__((__sfr__));
__extension__ typedef struct tagADTRIG2HBITS {
  union {
    struct {
      uint16_t TRGSRC10:5;
      uint16_t :3;
      uint16_t TRGSRC11:5;
    };
    struct {
      uint16_t TRIGSRC100:1;
      uint16_t TRIGSRC101:1;
      uint16_t TRIGSRC102:1;
      uint16_t TRIGSRC103:1;
      uint16_t TRIGSRC104:1;
      uint16_t :3;
      uint16_t TRGSRC110:1;
      uint16_t TRGSRC111:1;
      uint16_t TRGSRC112:1;
      uint16_t TRGSRC113:1;
      uint16_t TRGSRC114:1;
    };
    struct {
      uint16_t TRGSRC100:1;
      uint16_t TRGSRC101:1;
      uint16_t TRGSRC102:1;
      uint16_t TRGSRC103:1;
      uint16_t TRGSRC104:1;
    };
  };
} ADTRIG2HBITS;
extern volatile ADTRIG2HBITS ADTRIG2Hbits __attribute__((__sfr__));

#define ADTRIG3L ADTRIG3L
extern volatile uint16_t ADTRIG3L __attribute__((__sfr__));
__extension__ typedef struct tagADTRIG3LBITS {
  union {
    struct {
      uint16_t TRGSRC12:5;
      uint16_t :3;
      uint16_t TRGSRC13:5;
    };
    struct {
      uint16_t TRIGSRC120:1;
      uint16_t TRIGSRC121:1;
      uint16_t TRIGSRC122:1;
      uint16_t TRIGSRC123:1;
      uint16_t TRIGSRC124:1;
      uint16_t :3;
      uint16_t TRGSRC130:1;
      uint16_t TRGSRC131:1;
      uint16_t TRGSRC132:1;
      uint16_t TRGSRC133:1;
      uint16_t TRGSRC134:1;
    };
    struct {
      uint16_t TRGSRC120:1;
      uint16_t TRGSRC121:1;
      uint16_t TRGSRC122:1;
      uint16_t TRGSRC123:1;
      uint16_t TRGSRC124:1;
    };
  };
} ADTRIG3LBITS;
extern volatile ADTRIG3LBITS ADTRIG3Lbits __attribute__((__sfr__));

#define ADTRIG3H ADTRIG3H
extern volatile uint16_t ADTRIG3H __attribute__((__sfr__));
__extension__ typedef struct tagADTRIG3HBITS {
  union {
    struct {
      uint16_t TRGSRC14:5;
    };
    struct {
      uint16_t TRIGSRC140:1;
      uint16_t TRIGSRC141:1;
      uint16_t TRIGSRC142:1;
      uint16_t TRIGSRC143:1;
      uint16_t TRIGSRC144:1;
    };
    struct {
      uint16_t TRGSRC140:1;
      uint16_t TRGSRC141:1;
      uint16_t TRGSRC142:1;
      uint16_t TRGSRC143:1;
      uint16_t TRGSRC144:1;
    };
  };
} ADTRIG3HBITS;
extern volatile ADTRIG3HBITS ADTRIG3Hbits __attribute__((__sfr__));

#define ADCMP0CON ADCMP0CON
extern volatile uint16_t ADCMP0CON __attribute__((__sfr__));
__extension__ typedef struct tagADCMP0CONBITS {
  union {
    struct {
      uint16_t LOLO:1;
      uint16_t LOHI:1;
      uint16_t HILO:1;
      uint16_t HIHI:1;
      uint16_t BTWN:1;
      uint16_t STAT:1;
      uint16_t IE:1;
      uint16_t CMPEN:1;
      uint16_t CHNL:5;
    };
    struct {
      uint16_t :8;
      uint16_t CHNL0:1;
      uint16_t CHNL1:1;
      uint16_t CHNL2:1;
      uint16_t CHNL3:1;
      uint16_t CHNL4:1;
    };
  };
} ADCMP0CONBITS;
extern volatile ADCMP0CONBITS ADCMP0CONbits __attribute__((__sfr__));

#define ADCMP1CON ADCMP1CON
extern volatile uint16_t ADCMP1CON __attribute__((__sfr__));
__extension__ typedef struct tagADCMP1CONBITS {
  union {
    struct {
      uint16_t LOLO:1;
      uint16_t LOHI:1;
      uint16_t HILO:1;
      uint16_t HIHI:1;
      uint16_t BTWN:1;
      uint16_t STAT:1;
      uint16_t IE:1;
      uint16_t CMPEN:1;
      uint16_t CHNL:5;
    };
    struct {
      uint16_t :8;
      uint16_t CHNL0:1;
      uint16_t CHNL1:1;
      uint16_t CHNL2:1;
      uint16_t CHNL3:1;
      uint16_t CHNL4:1;
    };
  };
} ADCMP1CONBITS;
extern volatile ADCMP1CONBITS ADCMP1CONbits __attribute__((__sfr__));

#define ADLVLTRGL ADLVLTRGL
extern volatile uint16_t ADLVLTRGL __attribute__((__sfr__));
typedef struct tagADLVLTRGLBITS {
  uint16_t LVLEN0:1;
  uint16_t LVLEN1:1;
  uint16_t LVLEN2:1;
  uint16_t LVLEN3:1;
  uint16_t LVLEN4:1;
  uint16_t LVLEN5:1;
  uint16_t LVLEN6:1;
  uint16_t LVLEN7:1;
  uint16_t LVLEN8:1;
  uint16_t LVLEN9:1;
  uint16_t LVLEN10:1;
  uint16_t LVLEN11:1;
  uint16_t LVLEN12:1;
  uint16_t LVLEN13:1;
  uint16_t LVLEN14:1;
} ADLVLTRGLBITS;
extern volatile ADLVLTRGLBITS ADLVLTRGLbits __attribute__((__sfr__));

#define ADCORE0L ADCORE0L
extern volatile uint16_t ADCORE0L __attribute__((__sfr__));
__extension__ typedef struct tagADCORE0LBITS {
  union {
    struct {
      uint16_t SAMC:10;
    };
    struct {
      uint16_t SAMC0:1;
      uint16_t SAMC1:1;
      uint16_t SAMC2:1;
      uint16_t SAMC3:1;
      uint16_t SAMC4:1;
      uint16_t SAMC5:1;
      uint16_t SAMC6:1;
      uint16_t SAMC7:1;
      uint16_t SAMC8:1;
      uint16_t SAMC9:1;
    };
  };
} ADCORE0LBITS;
extern volatile ADCORE0LBITS ADCORE0Lbits __attribute__((__sfr__));

#define ADCORE0H ADCORE0H
extern volatile uint16_t ADCORE0H __attribute__((__sfr__));
__extension__ typedef struct tagADCORE0HBITS {
  union {
    struct {
      uint16_t ADCS:7;
      uint16_t :1;
      uint16_t RES:2;
      uint16_t EISEL:3;
    };
    struct {
      uint16_t ADCS0:1;
      uint16_t ADCS1:1;
      uint16_t ADCS2:1;
      uint16_t ADCS3:1;
      uint16_t ADCS4:1;
      uint16_t ADCS5:1;
      uint16_t ADCS6:1;
      uint16_t :1;
      uint16_t RES0:1;
      uint16_t RES1:1;
      uint16_t EISEL0:1;
      uint16_t EISEL1:1;
      uint16_t EISEL2:1;
    };
  };
} ADCORE0HBITS;
extern volatile ADCORE0HBITS ADCORE0Hbits __attribute__((__sfr__));

