MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP16GS202/mcu.h
extern volatile IPC16BITS IPC16bits __attribute__((__sfr__));

#define IPC18 IPC18
extern volatile uint16_t IPC18 __attribute__((__sfr__));
__extension__ typedef struct tagIPC18BITS {
  union {
    struct {
      uint16_t :4;
      uint16_t PSESIP:3;
    };
    struct {
      uint16_t :4;
      uint16_t PSESIP0:1;
      uint16_t PSESIP1:1;
      uint16_t PSESIP2:1;
    };
  };
} IPC18BITS;
extern volatile IPC18BITS IPC18bits __attribute__((__sfr__));

#define IPC23 IPC23
extern volatile uint16_t IPC23 __attribute__((__sfr__));
__extension__ typedef struct tagIPC23BITS {
  union {
    struct {
      uint16_t :8;
      uint16_t PWM1IP:3;
      uint16_t :1;
      uint16_t PWM2IP:3;
    };
    struct {
      uint16_t :8;
      uint16_t PWM1IP0:1;
      uint16_t PWM1IP1:1;
      uint16_t PWM1IP2:1;
      uint16_t :1;
      uint16_t PWM2IP0:1;
      uint16_t PWM2IP1:1;
      uint16_t PWM2IP2:1;
    };
  };
} IPC23BITS;
extern volatile IPC23BITS IPC23bits __attribute__((__sfr__));

#define IPC24 IPC24
extern volatile uint16_t IPC24 __attribute__((__sfr__));
__extension__ typedef struct tagIPC24BITS {
  union {
    struct {
      uint16_t PWM3IP:3;
    };
    struct {
      uint16_t PWM3IP0:1;
      uint16_t PWM3IP1:1;
      uint16_t PWM3IP2:1;
    };
  };
} IPC24BITS;
extern volatile IPC24BITS IPC24bits __attribute__((__sfr__));

#define IPC25 IPC25
extern volatile uint16_t IPC25 __attribute__((__sfr__));
__extension__ typedef struct tagIPC25BITS {
  union {
    struct {
      uint16_t :12;
      uint16_t AC2IP:3;
    };
    struct {
      uint16_t :12;
      uint16_t AC2IP0:1;
      uint16_t AC2IP1:1;
      uint16_t AC2IP2:1;
    };
  };
} IPC25BITS;
extern volatile IPC25BITS IPC25bits __attribute__((__sfr__));

#define IPC27 IPC27
extern volatile uint16_t IPC27 __attribute__((__sfr__));
__extension__ typedef struct tagIPC27BITS {
  union {
    struct {
      uint16_t :8;
      uint16_t ADCAN0IP:3;
      uint16_t :1;
      uint16_t ADCAN1IP:3;
    };
    struct {
      uint16_t :8;
      uint16_t ADCAN0IP0:1;
      uint16_t ADCAN0IP1:1;
      uint16_t ADCAN0IP2:1;
      uint16_t :1;
      uint16_t ADCAN1IP0:1;
      uint16_t ADCAN1IP1:1;
      uint16_t ADCAN1IP2:1;
    };
  };
} IPC27BITS;
extern volatile IPC27BITS IPC27bits __attribute__((__sfr__));

#define IPC28 IPC28
extern volatile uint16_t IPC28 __attribute__((__sfr__));
__extension__ typedef struct tagIPC28BITS {
  union {
    struct {
      uint16_t ADCAN2IP:3;
      uint16_t :1;
      uint16_t ADCAN3IP:3;
      uint16_t :1;
      uint16_t ADCAN4IP:3;
      uint16_t :1;
      uint16_t ADCAN5IP:3;
    };
    struct {
      uint16_t ADCAN2IP0:1;
      uint16_t ADCAN2IP1:1;
      uint16_t ADCAN2IP2:1;
      uint16_t :1;
      uint16_t ADCAN3IP0:1;
      uint16_t ADCAN3IP1:1;
      uint16_t ADCAN3IP2:1;
      uint16_t :1;
      uint16_t ADCAN4IP0:1;
      uint16_t ADCAN4IP1:1;
      uint16_t ADCAN4IP2:1;
      uint16_t :1;
      uint16_t ADCAN5IP0:1;
      uint16_t ADCAN5IP1:1;
      uint16_t ADCAN5IP2:1;
    };
  };
} IPC28BITS;
extern volatile IPC28BITS IPC28bits __attribute__((__sfr__));

#define IPC29 IPC29
extern volatile uint16_t IPC29 __attribute__((__sfr__));
__extension__ typedef struct tagIPC29BITS {
  union {
    struct {
      uint16_t ADCAN6IP:3;
      uint16_t :1;
      uint16_t ADCAN7IP:3;
    };
    struct {
      uint16_t ADCAN6IP0:1;
      uint16_t ADCAN6IP1:1;
      uint16_t ADCAN6IP2:1;
      uint16_t :1;
      uint16_t ADCAN7IP0:1;
      uint16_t ADCAN7IP1:1;
      uint16_t ADCAN7IP2:1;
    };
  };
} IPC29BITS;
extern volatile IPC29BITS IPC29bits __attribute__((__sfr__));

#define IPC37 IPC37
extern volatile uint16_t IPC37 __attribute__((__sfr__));
__extension__ typedef struct tagIPC37BITS {
  union {
    struct {
      uint16_t :12;
      uint16_t ADCAN8IP:3;
    };
    struct {
      uint16_t :12;
      uint16_t ADCAN8IP0:1;
      uint16_t ADCAN8IP1:1;
      uint16_t ADCAN8IP2:1;
    };
  };
} IPC37BITS;
extern volatile IPC37BITS IPC37bits __attribute__((__sfr__));

#define IPC38 IPC38
extern volatile uint16_t IPC38 __attribute__((__sfr__));
__extension__ typedef struct tagIPC38BITS {
  union {
    struct {
      uint16_t ADCAN9IP:3;
      uint16_t :1;
      uint16_t ADCAN10IP:3;
      uint16_t :1;
      uint16_t ADCAN11IP:3;
      uint16_t :1;
      uint16_t ADCAN12IP:3;
    };
    struct {
      uint16_t ADCAN9IP0:1;
      uint16_t ADCAN9IP1:1;
      uint16_t ADCAN9IP2:1;
      uint16_t :1;
      uint16_t ADCAN10IP0:1;
      uint16_t ADCAN10IP1:1;
      uint16_t ADCAN10IP2:1;
      uint16_t :1;
      uint16_t ADCAN11IP0:1;
      uint16_t ADCAN11IP1:1;
      uint16_t ADCAN11IP2:1;
      uint16_t :1;
      uint16_t ADCAN12IP0:1;
      uint16_t ADCAN12IP1:1;
      uint16_t ADCAN12IP2:1;
    };
  };
} IPC38BITS;
extern volatile IPC38BITS IPC38bits __attribute__((__sfr__));

#define IPC39 IPC39
extern volatile uint16_t IPC39 __attribute__((__sfr__));
__extension__ typedef struct tagIPC39BITS {
  union {
    struct {
      uint16_t ADCAN13IP:3;
      uint16_t :1;
      uint16_t ADCAN14IP:3;
    };
    struct {
      uint16_t ADCAN13IP0:1;
      uint16_t ADCAN13IP1:1;
      uint16_t ADCAN13IP2:1;
      uint16_t :1;
      uint16_t ADCAN14IP0:1;
      uint16_t ADCAN14IP1:1;
      uint16_t ADCAN14IP2:1;
    };
  };
} IPC39BITS;
extern volatile IPC39BITS IPC39bits __attribute__((__sfr__));

#define IPC43 IPC43
extern volatile uint16_t IPC43 __attribute__((__sfr__));
__extension__ typedef struct tagIPC43BITS {
  union {
    struct {
      uint16_t :4;
      uint16_t I2C1BCIP:3;
    };
    struct {
      uint16_t :4;
      uint16_t I2C1BCIP0:1;
      uint16_t I2C1BCIP1:1;
      uint16_t I2C1BCIP2:1;
    };
  };
} IPC43BITS;
extern volatile IPC43BITS IPC43bits __attribute__((__sfr__));

#define IPC44 IPC44
extern volatile uint16_t IPC44 __attribute__((__sfr__));
__extension__ typedef struct tagIPC44BITS {
  union {
    struct {
      uint16_t :4;
      uint16_t ADCMP0IP:3;
      uint16_t :1;
      uint16_t ADCMP1IP:3;
      uint16_t :1;
      uint16_t ADFL0IP:3;
    };
    struct {
      uint16_t :4;
      uint16_t ADCMP1IP0:1;
      uint16_t ADCMP1IP1:1;
      uint16_t ADCMP1IP2:1;
      uint16_t :1;
      uint16_t ADCMP2IP0:1;
      uint16_t ADCMP2IP1:1;
      uint16_t ADCMP2IP2:1;
      uint16_t :1;
      uint16_t ADCFLTR1IP0:1;
      uint16_t ADCFLTR1IP1:1;
      uint16_t ADCFLTR1IP2:1;
    };
  };
} IPC44BITS;
