MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP16GS202/mcu.h
#define _ADEIEL_EIEN10_POSITION                  0x0000000A
#define _ADEIEL_EIEN10_MASK                      0x00000400
#define _ADEIEL_EIEN10_LENGTH                    0x00000001

#define _ADEIEL_EIEN11_POSITION                  0x0000000B
#define _ADEIEL_EIEN11_MASK                      0x00000800
#define _ADEIEL_EIEN11_LENGTH                    0x00000001

#define _ADEIEL_EIEN12_POSITION                  0x0000000C
#define _ADEIEL_EIEN12_MASK                      0x00001000
#define _ADEIEL_EIEN12_LENGTH                    0x00000001

#define _ADEIEL_EIEN13_POSITION                  0x0000000D
#define _ADEIEL_EIEN13_MASK                      0x00002000
#define _ADEIEL_EIEN13_LENGTH                    0x00000001

#define _ADEIEL_EIEN14_POSITION                  0x0000000E
#define _ADEIEL_EIEN14_MASK                      0x00004000
#define _ADEIEL_EIEN14_LENGTH                    0x00000001

#define _ADEISTATL_EISTAT0_POSITION              0x00000000
#define _ADEISTATL_EISTAT0_MASK                  0x00000001
#define _ADEISTATL_EISTAT0_LENGTH                0x00000001

#define _ADEISTATL_EISTAT1_POSITION              0x00000001
#define _ADEISTATL_EISTAT1_MASK                  0x00000002
#define _ADEISTATL_EISTAT1_LENGTH                0x00000001

#define _ADEISTATL_EISTAT2_POSITION              0x00000002
#define _ADEISTATL_EISTAT2_MASK                  0x00000004
#define _ADEISTATL_EISTAT2_LENGTH                0x00000001

#define _ADEISTATL_EISTAT3_POSITION              0x00000003
#define _ADEISTATL_EISTAT3_MASK                  0x00000008
#define _ADEISTATL_EISTAT3_LENGTH                0x00000001

#define _ADEISTATL_EISTAT4_POSITION              0x00000004
#define _ADEISTATL_EISTAT4_MASK                  0x00000010
#define _ADEISTATL_EISTAT4_LENGTH                0x00000001

#define _ADEISTATL_EISTAT5_POSITION              0x00000005
#define _ADEISTATL_EISTAT5_MASK                  0x00000020
#define _ADEISTATL_EISTAT5_LENGTH                0x00000001

#define _ADEISTATL_EISTAT6_POSITION              0x00000006
#define _ADEISTATL_EISTAT6_MASK                  0x00000040
#define _ADEISTATL_EISTAT6_LENGTH                0x00000001

#define _ADEISTATL_EISTAT7_POSITION              0x00000007
#define _ADEISTATL_EISTAT7_MASK                  0x00000080
#define _ADEISTATL_EISTAT7_LENGTH                0x00000001

#define _ADEISTATL_EISTAT8_POSITION              0x00000008
#define _ADEISTATL_EISTAT8_MASK                  0x00000100
#define _ADEISTATL_EISTAT8_LENGTH                0x00000001

#define _ADEISTATL_EISTAT9_POSITION              0x00000009
#define _ADEISTATL_EISTAT9_MASK                  0x00000200
#define _ADEISTATL_EISTAT9_LENGTH                0x00000001

#define _ADEISTATL_EISTAT10_POSITION             0x0000000A
#define _ADEISTATL_EISTAT10_MASK                 0x00000400
#define _ADEISTATL_EISTAT10_LENGTH               0x00000001

#define _ADEISTATL_EISTAT11_POSITION             0x0000000B
#define _ADEISTATL_EISTAT11_MASK                 0x00000800
#define _ADEISTATL_EISTAT11_LENGTH               0x00000001

#define _ADEISTATL_EISTAT12_POSITION             0x0000000C
#define _ADEISTATL_EISTAT12_MASK                 0x00001000
#define _ADEISTATL_EISTAT12_LENGTH               0x00000001

#define _ADEISTATL_EISTAT13_POSITION             0x0000000D
#define _ADEISTATL_EISTAT13_MASK                 0x00002000
#define _ADEISTATL_EISTAT13_LENGTH               0x00000001

#define _ADEISTATL_EISTAT14_POSITION             0x0000000E
#define _ADEISTATL_EISTAT14_MASK                 0x00004000
#define _ADEISTATL_EISTAT14_LENGTH               0x00000001

#define _ADCON5L_C0PWR_POSITION                  0x00000000
#define _ADCON5L_C0PWR_MASK                      0x00000001
#define _ADCON5L_C0PWR_LENGTH                    0x00000001

#define _ADCON5L_C1PWR_POSITION                  0x00000001
#define _ADCON5L_C1PWR_MASK                      0x00000002
#define _ADCON5L_C1PWR_LENGTH                    0x00000001

#define _ADCON5L_C2PWR_POSITION                  0x00000002
#define _ADCON5L_C2PWR_MASK                      0x00000004
#define _ADCON5L_C2PWR_LENGTH                    0x00000001

#define _ADCON5L_C3PWR_POSITION                  0x00000003
#define _ADCON5L_C3PWR_MASK                      0x00000008
#define _ADCON5L_C3PWR_LENGTH                    0x00000001

#define _ADCON5L_C4PWR_POSITION                  0x00000004
#define _ADCON5L_C4PWR_MASK                      0x00000010
#define _ADCON5L_C4PWR_LENGTH                    0x00000001

#define _ADCON5L_C5PWR_POSITION                  0x00000005
#define _ADCON5L_C5PWR_MASK                      0x00000020
#define _ADCON5L_C5PWR_LENGTH                    0x00000001

#define _ADCON5L_C6PWR_POSITION                  0x00000006
#define _ADCON5L_C6PWR_MASK                      0x00000040
#define _ADCON5L_C6PWR_LENGTH                    0x00000001

#define _ADCON5L_SHRPWR_POSITION                 0x00000007
#define _ADCON5L_SHRPWR_MASK                     0x00000080
#define _ADCON5L_SHRPWR_LENGTH                   0x00000001

#define _ADCON5L_C0RDY_POSITION                  0x00000008
#define _ADCON5L_C0RDY_MASK                      0x00000100
#define _ADCON5L_C0RDY_LENGTH                    0x00000001

#define _ADCON5L_C1RDY_POSITION                  0x00000009
#define _ADCON5L_C1RDY_MASK                      0x00000200
#define _ADCON5L_C1RDY_LENGTH                    0x00000001

#define _ADCON5L_C2RDY_POSITION                  0x0000000A
#define _ADCON5L_C2RDY_MASK                      0x00000400
#define _ADCON5L_C2RDY_LENGTH                    0x00000001

#define _ADCON5L_C3RDY_POSITION                  0x0000000B
#define _ADCON5L_C3RDY_MASK                      0x00000800
#define _ADCON5L_C3RDY_LENGTH                    0x00000001

#define _ADCON5L_C4RDY_POSITION                  0x0000000C
#define _ADCON5L_C4RDY_MASK                      0x00001000
#define _ADCON5L_C4RDY_LENGTH                    0x00000001

#define _ADCON5L_C5RDY_POSITION                  0x0000000D
#define _ADCON5L_C5RDY_MASK                      0x00002000
#define _ADCON5L_C5RDY_LENGTH                    0x00000001

#define _ADCON5L_C6RDY_POSITION                  0x0000000E
#define _ADCON5L_C6RDY_MASK                      0x00004000
#define _ADCON5L_C6RDY_LENGTH                    0x00000001

#define _ADCON5L_SHRRDY_POSITION                 0x0000000F
#define _ADCON5L_SHRRDY_MASK                     0x00008000
#define _ADCON5L_SHRRDY_LENGTH                   0x00000001

#define _ADCON5H_C0CIE_POSITION                  0x00000000
#define _ADCON5H_C0CIE_MASK                      0x00000001
#define _ADCON5H_C0CIE_LENGTH                    0x00000001

