MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP16GS202/mcu.h
#define _ADCON5H_C1CIE_POSITION                  0x00000001
#define _ADCON5H_C1CIE_MASK                      0x00000002
#define _ADCON5H_C1CIE_LENGTH                    0x00000001

#define _ADCON5H_C2CIE_POSITION                  0x00000002
#define _ADCON5H_C2CIE_MASK                      0x00000004
#define _ADCON5H_C2CIE_LENGTH                    0x00000001

#define _ADCON5H_C3CIE_POSITION                  0x00000003
#define _ADCON5H_C3CIE_MASK                      0x00000008
#define _ADCON5H_C3CIE_LENGTH                    0x00000001

#define _ADCON5H_C4CIE_POSITION                  0x00000004
#define _ADCON5H_C4CIE_MASK                      0x00000010
#define _ADCON5H_C4CIE_LENGTH                    0x00000001

#define _ADCON5H_C5CIE_POSITION                  0x00000005
#define _ADCON5H_C5CIE_MASK                      0x00000020
#define _ADCON5H_C5CIE_LENGTH                    0x00000001

#define _ADCON5H_C6CIE_POSITION                  0x00000006
#define _ADCON5H_C6CIE_MASK                      0x00000040
#define _ADCON5H_C6CIE_LENGTH                    0x00000001

#define _ADCON5H_SHRCIE_POSITION                 0x00000007
#define _ADCON5H_SHRCIE_MASK                     0x00000080
#define _ADCON5H_SHRCIE_LENGTH                   0x00000001

#define _ADCON5H_WARMTIME_POSITION               0x00000008
#define _ADCON5H_WARMTIME_MASK                   0x00000F00
#define _ADCON5H_WARMTIME_LENGTH                 0x00000004

#define _ADCON5H_C0C1E_POSITION                  0x00000000
#define _ADCON5H_C0C1E_MASK                      0x00000001
#define _ADCON5H_C0C1E_LENGTH                    0x00000001

#define _ADCON5H_C1C1E_POSITION                  0x00000001
#define _ADCON5H_C1C1E_MASK                      0x00000002
#define _ADCON5H_C1C1E_LENGTH                    0x00000001

#define _ADCON5H_C2C1E_POSITION                  0x00000002
#define _ADCON5H_C2C1E_MASK                      0x00000004
#define _ADCON5H_C2C1E_LENGTH                    0x00000001

#define _ADCON5H_C3C1E_POSITION                  0x00000003
#define _ADCON5H_C3C1E_MASK                      0x00000008
#define _ADCON5H_C3C1E_LENGTH                    0x00000001

#define _ADCON5H_C4C1E_POSITION                  0x00000004
#define _ADCON5H_C4C1E_MASK                      0x00000010
#define _ADCON5H_C4C1E_LENGTH                    0x00000001

#define _ADCON5H_C5C1E_POSITION                  0x00000005
#define _ADCON5H_C5C1E_MASK                      0x00000020
#define _ADCON5H_C5C1E_LENGTH                    0x00000001

#define _ADCON5H_C6C1E_POSITION                  0x00000006
#define _ADCON5H_C6C1E_MASK                      0x00000040
#define _ADCON5H_C6C1E_LENGTH                    0x00000001

#define _ADCAL0L_CAL0RUN_POSITION                0x00000000
#define _ADCAL0L_CAL0RUN_MASK                    0x00000001
#define _ADCAL0L_CAL0RUN_LENGTH                  0x00000001

#define _ADCAL0L_CAL0EN_POSITION                 0x00000001
#define _ADCAL0L_CAL0EN_MASK                     0x00000002
#define _ADCAL0L_CAL0EN_LENGTH                   0x00000001

#define _ADCAL0L_CAL0DIFF_POSITION               0x00000002
#define _ADCAL0L_CAL0DIFF_MASK                   0x00000004
#define _ADCAL0L_CAL0DIFF_LENGTH                 0x00000001

#define _ADCAL0L_CAL0SKIP_POSITION               0x00000003
#define _ADCAL0L_CAL0SKIP_MASK                   0x00000008
#define _ADCAL0L_CAL0SKIP_LENGTH                 0x00000001

#define _ADCAL0L_CAL0RDY_POSITION                0x00000007
#define _ADCAL0L_CAL0RDY_MASK                    0x00000080
#define _ADCAL0L_CAL0RDY_LENGTH                  0x00000001

#define _ADCAL0L_CAL1RUN_POSITION                0x00000008
#define _ADCAL0L_CAL1RUN_MASK                    0x00000100
#define _ADCAL0L_CAL1RUN_LENGTH                  0x00000001

#define _ADCAL0L_CAL1EN_POSITION                 0x00000009
#define _ADCAL0L_CAL1EN_MASK                     0x00000200
#define _ADCAL0L_CAL1EN_LENGTH                   0x00000001

#define _ADCAL0L_CAL1DIFF_POSITION               0x0000000A
#define _ADCAL0L_CAL1DIFF_MASK                   0x00000400
#define _ADCAL0L_CAL1DIFF_LENGTH                 0x00000001

#define _ADCAL0L_CAL1SKIP_POSITION               0x0000000B
#define _ADCAL0L_CAL1SKIP_MASK                   0x00000800
#define _ADCAL0L_CAL1SKIP_LENGTH                 0x00000001

#define _ADCAL0L_CAL1RDY_POSITION                0x0000000F
#define _ADCAL0L_CAL1RDY_MASK                    0x00008000
#define _ADCAL0L_CAL1RDY_LENGTH                  0x00000001

#define _ADCAL1H_CSHRRUN_POSITION                0x00000008
#define _ADCAL1H_CSHRRUN_MASK                    0x00000100
#define _ADCAL1H_CSHRRUN_LENGTH                  0x00000001

#define _ADCAL1H_CSHREN_POSITION                 0x00000009
#define _ADCAL1H_CSHREN_MASK                     0x00000200
#define _ADCAL1H_CSHREN_LENGTH                   0x00000001

#define _ADCAL1H_CSHRDIFF_POSITION               0x0000000A
#define _ADCAL1H_CSHRDIFF_MASK                   0x00000400
#define _ADCAL1H_CSHRDIFF_LENGTH                 0x00000001

#define _ADCAL1H_CSHRSKIP_POSITION               0x0000000B
#define _ADCAL1H_CSHRSKIP_MASK                   0x00000800
#define _ADCAL1H_CSHRSKIP_LENGTH                 0x00000001

#define _ADCAL1H_CSHRRDY_POSITION                0x0000000F
#define _ADCAL1H_CSHRRDY_MASK                    0x00008000
#define _ADCAL1H_CSHRRDY_LENGTH                  0x00000001

#define _PGA1CON_GAIN_POSITION                   0x00000000
#define _PGA1CON_GAIN_MASK                       0x00000007
#define _PGA1CON_GAIN_LENGTH                     0x00000003

#define _PGA1CON_SELNI_POSITION                  0x00000008
#define _PGA1CON_SELNI_MASK                      0x00000700
#define _PGA1CON_SELNI_LENGTH                    0x00000003

#define _PGA1CON_SELPI_POSITION                  0x0000000B
#define _PGA1CON_SELPI_MASK                      0x00003800
#define _PGA1CON_SELPI_LENGTH                    0x00000003

#define _PGA1CON_PGAEN_POSITION                  0x0000000F
#define _PGA1CON_PGAEN_MASK                      0x00008000
#define _PGA1CON_PGAEN_LENGTH                    0x00000001

