MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP16GS202/mcu.h
#define _RPOR6_RP45R5_POSITION                   0x0000000D
#define _RPOR6_RP45R5_MASK                       0x00002000
#define _RPOR6_RP45R5_LENGTH                     0x00000001

#define _RPOR7_RP46R_POSITION                    0x00000000
#define _RPOR7_RP46R_MASK                        0x0000003F
#define _RPOR7_RP46R_LENGTH                      0x00000006

#define _RPOR7_RP47R_POSITION                    0x00000008
#define _RPOR7_RP47R_MASK                        0x00003F00
#define _RPOR7_RP47R_LENGTH                      0x00000006

#define _RPOR7_RP46R0_POSITION                   0x00000000
#define _RPOR7_RP46R0_MASK                       0x00000001
#define _RPOR7_RP46R0_LENGTH                     0x00000001

#define _RPOR7_RP46R1_POSITION                   0x00000001
#define _RPOR7_RP46R1_MASK                       0x00000002
#define _RPOR7_RP46R1_LENGTH                     0x00000001

#define _RPOR7_RP46R2_POSITION                   0x00000002
#define _RPOR7_RP46R2_MASK                       0x00000004
#define _RPOR7_RP46R2_LENGTH                     0x00000001

#define _RPOR7_RP46R3_POSITION                   0x00000003
#define _RPOR7_RP46R3_MASK                       0x00000008
#define _RPOR7_RP46R3_LENGTH                     0x00000001

#define _RPOR7_RP46R4_POSITION                   0x00000004
#define _RPOR7_RP46R4_MASK                       0x00000010
#define _RPOR7_RP46R4_LENGTH                     0x00000001

#define _RPOR7_RP46R5_POSITION                   0x00000005
#define _RPOR7_RP46R5_MASK                       0x00000020
#define _RPOR7_RP46R5_LENGTH                     0x00000001

#define _RPOR7_RP47R0_POSITION                   0x00000008
#define _RPOR7_RP47R0_MASK                       0x00000100
#define _RPOR7_RP47R0_LENGTH                     0x00000001

#define _RPOR7_RP47R1_POSITION                   0x00000009
#define _RPOR7_RP47R1_MASK                       0x00000200
#define _RPOR7_RP47R1_LENGTH                     0x00000001

#define _RPOR7_RP47R2_POSITION                   0x0000000A
#define _RPOR7_RP47R2_MASK                       0x00000400
#define _RPOR7_RP47R2_LENGTH                     0x00000001

#define _RPOR7_RP47R3_POSITION                   0x0000000B
#define _RPOR7_RP47R3_MASK                       0x00000800
#define _RPOR7_RP47R3_LENGTH                     0x00000001

#define _RPOR7_RP47R4_POSITION                   0x0000000C
#define _RPOR7_RP47R4_MASK                       0x00001000
#define _RPOR7_RP47R4_LENGTH                     0x00000001

#define _RPOR7_RP47R5_POSITION                   0x0000000D
#define _RPOR7_RP47R5_MASK                       0x00002000
#define _RPOR7_RP47R5_LENGTH                     0x00000001

#define _RPOR8_RP176R_POSITION                   0x00000000
#define _RPOR8_RP176R_MASK                       0x0000003F
#define _RPOR8_RP176R_LENGTH                     0x00000006

#define _RPOR8_RP177R_POSITION                   0x00000008
#define _RPOR8_RP177R_MASK                       0x00003F00
#define _RPOR8_RP177R_LENGTH                     0x00000006

#define _RPOR8_RP176R0_POSITION                  0x00000000
#define _RPOR8_RP176R0_MASK                      0x00000001
#define _RPOR8_RP176R0_LENGTH                    0x00000001

#define _RPOR8_RP176R1_POSITION                  0x00000001
#define _RPOR8_RP176R1_MASK                      0x00000002
#define _RPOR8_RP176R1_LENGTH                    0x00000001

#define _RPOR8_RP176R2_POSITION                  0x00000002
#define _RPOR8_RP176R2_MASK                      0x00000004
#define _RPOR8_RP176R2_LENGTH                    0x00000001

#define _RPOR8_RP176R3_POSITION                  0x00000003
#define _RPOR8_RP176R3_MASK                      0x00000008
#define _RPOR8_RP176R3_LENGTH                    0x00000001

#define _RPOR8_RP176R4_POSITION                  0x00000004
#define _RPOR8_RP176R4_MASK                      0x00000010
#define _RPOR8_RP176R4_LENGTH                    0x00000001

#define _RPOR8_RP176R5_POSITION                  0x00000005
#define _RPOR8_RP176R5_MASK                      0x00000020
#define _RPOR8_RP176R5_LENGTH                    0x00000001

#define _RPOR8_RP177R0_POSITION                  0x00000008
#define _RPOR8_RP177R0_MASK                      0x00000100
#define _RPOR8_RP177R0_LENGTH                    0x00000001

#define _RPOR8_RP177R1_POSITION                  0x00000009
#define _RPOR8_RP177R1_MASK                      0x00000200
#define _RPOR8_RP177R1_LENGTH                    0x00000001

#define _RPOR8_RP177R2_POSITION                  0x0000000A
#define _RPOR8_RP177R2_MASK                      0x00000400
#define _RPOR8_RP177R2_LENGTH                    0x00000001

#define _RPOR8_RP177R3_POSITION                  0x0000000B
#define _RPOR8_RP177R3_MASK                      0x00000800
#define _RPOR8_RP177R3_LENGTH                    0x00000001

#define _RPOR8_RP177R4_POSITION                  0x0000000C
#define _RPOR8_RP177R4_MASK                      0x00001000
#define _RPOR8_RP177R4_LENGTH                    0x00000001

#define _RPOR8_RP177R5_POSITION                  0x0000000D
#define _RPOR8_RP177R5_MASK                      0x00002000
#define _RPOR8_RP177R5_LENGTH                    0x00000001

#define _RPOR9_RP178R_POSITION                   0x00000000
#define _RPOR9_RP178R_MASK                       0x0000003F
#define _RPOR9_RP178R_LENGTH                     0x00000006

#define _RPOR9_RP179R_POSITION                   0x00000008
#define _RPOR9_RP179R_MASK                       0x00003F00
#define _RPOR9_RP179R_LENGTH                     0x00000006

#define _RPOR9_RP178R0_POSITION                  0x00000000
#define _RPOR9_RP178R0_MASK                      0x00000001
#define _RPOR9_RP178R0_LENGTH                    0x00000001

#define _RPOR9_RP178R1_POSITION                  0x00000001
#define _RPOR9_RP178R1_MASK                      0x00000002
#define _RPOR9_RP178R1_LENGTH                    0x00000001

#define _RPOR9_RP178R2_POSITION                  0x00000002
#define _RPOR9_RP178R2_MASK                      0x00000004
#define _RPOR9_RP178R2_LENGTH                    0x00000001

#define _RPOR9_RP178R3_POSITION                  0x00000003
#define _RPOR9_RP178R3_MASK                      0x00000008
#define _RPOR9_RP178R3_LENGTH                    0x00000001

